_processing/2013-10-21-neo.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Konventionelles Tastaturlayout</a></li>
<li><a href="#sec-2">2. Alternative Tastaturlayouts</a>
<ul>
<li><a href="#sec-2-1">2.1. Dvorak</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. Ergebnisse</a></li>
<li><a href="#sec-2-1-2">2.1.2. Umsetzung</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Ristome</a></li>
<li><a href="#sec-2-3">2.3. Neo</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. Neo2</a></li>
<li><a href="#sec-2-3-2">2.3.2. AdNW</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Vor zwei Jahren bin ich mehr oder minder über das alternative Tastaturlayout Neo gestolpert und mich seither intensiv mit Ergonomie und der Geschichte des konventionellen QWERTY-Layouts auseinandergesetzt.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Konventionelles Tastaturlayout</h2>
<div class="outline-text-2" id="text-1">
<p>
Die heutige übliche Tastaturbelegung geht auf das 19. Jahrhundert zurück. Ziel war, häufige Buchstabenfolgen auf der vormaligen alphabetischen Anordnung der Schreibmaschinentasten möglichst weit auseinanderzulegen, um ein Verkanten der Hämmer zu vermeiden.
</p>

<p>
Somit wurde auf Grund einer technischen Einschränkung die Tasten explizit so angeordnet, dass sie für den Menschen möglichst schlecht liegen. Diesen technischen Einschränkungen unterliegen wir heutzutage natürlich nicht mehr, jedoch hat sich auf Grund von der bereits etablierten Konvention das bestehende Layout (bis auf regionale Varianten) nicht mehr geändert.
</p>

<p>
Eine weitere Besonderheit ist, dass man auf der englischen Variante "Typewriter" komplett auf der obersten Reihe schreiben kann, was wohl ein Easteregg ist.
</p>

<p>
Der horizontale Tastenversatz liegt auch an den Hämmern, die Platz für ihre Traktur benötigten. Jedoch ist dieser Versatz nicht tippfreundlich, da man um höhere oder niedrigere Tasten zu erreichen man seinen Finger nicht nur strecken oder einziehen, sonder auch verdrehen muss.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Alternative Tastaturlayouts</h2>
<div class="outline-text-2" id="text-2">
<p>
Mit der Zeit bildeten sich Alternativen heraus, die aber allesamt nicht sehr populär sind, was daran liegen mag, da:
</p>
<ol class="org-ol">
<li>Viele kein Zehnfingersystem benutzen
</li>
<li>QWERTY der ubiquitäre Standard ist
</li>
<li>Die Nachteile nicht bekannt sind
</li>
<li>Die alternativen Layouts unbekannt sind
</li>
</ol>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Dvorak</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Das bekannteste und auch älteste Reformlayout ist das Dvorak-Layout, welches 1930 entwickelt wurde. 
</p>
</div>

<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Ergebnisse</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Hierfür wurden verschiedene Studien bezüglich Ergonomie und Effizienz durchgeführt. Wichtige, auch in aktuelleren Reformbelegungen präsente, Ergebnisse waren, dass:
</p>
<ul class="org-ul">
<li>Die Finger möglichst kurze Bewegungen durchführen sollten
</li>
<li>Dementsprechend sollten möglichst häufige Buchstaben in der Ruheposition der Finger sich befinden
</li>
<li>Der gleiche Finger nicht wiederholt werden sollte
</li>
<li>Im besonderen Maße sollten Sprünge des gleichen Fingers von der obern auf die untere Reihe, oder andersrum vermieden werden
</li>
<li>Dass sich die Hände im optimalfall abwechseln
</li>
<li>Bigramme, also häufige Buchstabenkombinationen, sollten weit entfernt liegen
</li>
<li>Die Hände sollten ungefähr gleich viel zu tun haben
</li>
<li>Die starken Finger sollten häufiger verwendet werden als die schwachen, um Ermüdungserscheinungen zu vermeiden
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Umsetzung</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Diese Ergebnisse konnten jedoch nur händisch umgesetzt werden, da entsprechende Computer zur Berechnung und Optimierung nicht zur Verfügung standen.
</p>

<p>
Nichts desto trotz wurde eine auch heute noch beliebte und ergonomische Tastaturbelegung erstellt, die in modernen Betriebssystemen als Standard einstellbar ist.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Ristome</h3>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Neo</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Diese Layout wurde 2004 entwickelt und speziell auf die deutsche Sprache optimiert. Die Ergebnisse Dvoraks wurden hier verwendet, um computergestützt das Layout zu optimieren. Jedoch waren die Optimierungsmöglichkeiten selbst noch nicht ausgereift, was zu der Entstehung von Neo2 führte.
</p>
</div>

<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> Neo2</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Hier wurde das gesamte Layout nochmals computergestützt deutlich verbessert, so werden die Finger viel weniger bewegt. Beispielsweise kann man 60% eines normalen deutschen Textes auf der Grundreihe tippen.
</p>

<p>
Eine phantastische Besonderheit des Neolayouts, welche mich damals dazu bewog, es zu lernen, ist, dass es noch zusätzliche Ebenen besitzt. Dies bedeutet, dass man über Spezialtasten die Belegung des Layouts ändern kann (wie z.B. bei Shift, welches für Großbuchstaben sorgt). So gibt es eine Ebene mit einem Zahlen- und Navigationsblock, welche unglaublich praktisch ist. So kann ich, während ich diesen Text hier schreibe, in der Grundposition ohne Probleme Zahlen eingeben, zum letzten Wortanfang springen, zum Zeilenanfang springen, in beide Richtungen Zeichen-, Wort-, Absatz- oder sogar Dokumentenweise löschen. Eine andere Ebene beinhaltet typische Programmierzeichen, eine weitere enthält griechische Buchstaben (für Formeln) und die letzte enthält mathematisch Spezialzeichen (Summationszeichen etc.). 
</p>
</div>
</div>
<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> AdNW</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Dieses Layout steht für „Aus der Neo-Welt“ und sieht sich selbst als Nachfolger des Neo-Layoutes. Hier wurde das Layout noch weiter verfeinert und nicht nur an deutschen, sondern auch an englischen Texten ausgerichtet. Somit ist dieses Layout weit internationaler und trotzdem auch in der deutschen Sprache dem Neo-Layout deutlich überlegen.
</p>

<p>
Meines Wissens nach ist dies derzeit das beste und vielseitigste Tastaturlayout. Es wurde von vielen auch schon unter dem Namen Neo3 vorgeschlagen, jedoch gibt es manch eine Unstimmigkeit zwischen den Projekten. Parallel dazu wird an einem anderen Neo3 gearbeitet, was sehr gut ist, da Neo bereits einen beachtlichen Bekanntheitsgrad erlangt hat, so ist das Neo-Layout in jeder Linuxdistro als Belegungsvariante des Deutschen auswählbar.
</p>
</div>
</div>
</div>
</div>
